{
  "info": {
    "name": "Simon Camacho",
    "title": "Software Engineer",
    "location": "Pampanga, Philippines",
    "description": "I am a developer who enjoys learning and expanding knowledge in the field of web. I am also determined to create solutions that provide excellent online experiences. Explore my portfolio to see my growing skills and dedication to quality development.",
    "siteName": "Simon Camacho Portfolio"
  },
  "containers": {
    "navBar": {
      "controls": {
        "toggle": "Toggle navigation menu"
      },
      "mobileMenu": {
        "title": "Navigation Menu",
        "description": "Browse through the main sections of the site.",
        "close": "Close mobile menu",
        "avatar": "Mobile Nav Avatar"
      },
      "links": {
        "home": "Home",
        "about": "About",
        "experience": "Experience",
        "projects": "Projects",
        "connect": "Connect"
      }
    }
  },
  "common": {
    "mainNavigation": "Main navigation",
    "navigateToHome": "Navigate to Home",
    "navigateToSection": "Navigate to {section} section",
    "languageDropdown": {
      "label": "Choose Language"
    },
    "themeToggle": {
      "darkMode": "Toggle Dark Mode",
      "lightMode": "Toggle Light Mode"
    },
    "chatButton": {
      "open": "Open chat"
    },
    "socialLinks": {
      "reddit": "Visit my Reddit profile",
      "frontendmentor": "Visit my Frontend Mentor profile",
      "github": "Visit my GitHub",
      "linkedin": "Visit my LinkedIn profile",
      "email": "Send me an email"
    },
    "skipToContentButton": {
      "open": "Skip to content"
    },
    "backButtonLabel": "Back",
    "or": "or"
  },
  "heroSection": {
    "contact": "Contact",
    "resume": "Resume",
    "backgroundCarlos": "Carlos",
    "backgroundSimon": "Simon",
    "heroImageAlt": "Hero Image"
  },
  "aboutSection": {
    "title": "About Me",
    "journeyHeader": "My Journey",
    "journey": "Hi! I’m Simon. A self-taught programmer who realized code could build worlds—or at least, really fun retro games.<br></br><br></br>My first encounter with coding was in 2018, when I stumbled on a YouTube video of someone building Tetris in C++. I was 16 and obsessed: Wait, you can just… make games? So I dove in, armed with C++ tutorials and dreams of recreating every pixelated classic I’d ever played (Snake, Frogger—you name it).<br></br><br></br>Fast-forward to today: I’m a Software Engineer at a startup, wrangling Next.js, NestJS, and Stripe to build apps that actually earn money (a wild concept to 16-year-old-me). My proudest moment? Learning payment integrations and seeing strangers use—and pay for—something I helped create.<br></br><br></br>But I’m itching for my next challenge. I love full-stack work—whether it’s crafting sleek UIs with shadcn or debugging backend mysteries. And while I didn’t take the traditional CS path, my time building systems and web apps proved something: code isn’t just about games; it’s about solving real problems.<br></br><br></br>When I'm not coding, I'm probably at the gym, sleeping, or dead.<br></br><br></br>I focus on clean fundamentals, building systems that are sustainable, easy to maintain, and built to last.",
    "skillsHeader": "My Skills"
  },
  "connectSection": {
    "title": "Connect",
    "getInTouch": {
      "title": "Get in touch",
      "description": "Whether you have an exciting project in mind, an amazing job opportunity, or just want to say hello, I'd be thrilled to hear from you!"
    },
    "onFrontendMentor": {
      "title": "Join me on Frontend Mentor!",
      "description": "Frontend Mentor is an excellent platform to sharpen your skills, and that's based on my experience. Follow me so we can share ideas and solutions, discuss various topics, and check out my work!",
      "screenshotsAlt": {
        "bmiCalculator": "Body Mass Index calculator",
        "articlePreviewComponent": "Article preview component",
        "skilledELearningLandingPage": "Responsive skilled E-learning landing page"
      }
    },
    "playChess": {
      "title": "Let's Play Chess!",
      "description": "Do you play chess? I do too! It's what I often do in my free time because it's relaxing and it sharpens my mind. Add me on Chess.com and challenge me to a game. I'm excited to play and learn from you!"
    }
  },
  "footer": {
    "attribution": "Designed and built by Simon Camacho",
    "starsCount": "{stars} stars",
    "forksCount": "{forks} forks"
  },
  "projectsSection": {
    "title": "Projects",
    "explore": "Explore",
    "projects": {
      "kanban": {
        "title": "Kanban Web App",
        "description": "Kanban is a project management tool that helps you manage your projects and tasks."
      },
      "audiophile": {
        "title": "Audiophile E-commerce Website",
        "description": "Audiophile is a project management tool that helps you manage your projects and tasks."
      },
      "pomodoro": {
        "title": "FEM Pomodoro App",
        "description": "Pomodoro is a project management tool that helps you manage your projects and tasks."
      }
    }
  },
  "experienceSection": {
    "title": "Experience",
    "atCompany": "@ {companyName}",
    "experiences": {
      "supafaya": {
        "title": "Software Engineer",
        "companyName": "Supafaya",
        "date": "2024 – Present",
        "descriptions": [
          "Develop full-stack features for e-commerce, event ticketing, and paid voting platforms across multiple projects",
          "Build and maintain systems such as product listings, payment integrations (Stripe, Xendit), and admin dashboards",
          "Lead CMS development for the Amora e-commerce site and payment-secured voting system for The House of Collab",
          "Integrate public APIs with external platforms like WordPress (Zumafest) and manage third-party services (ImageKit, Algolia, Firebase, Wix CMS)",
          "Collaborate with remote teams using Zulip and maintain clear communication with designers, developers, and product managers"
        ]
      },
      "staMonica": {
        "title": "IT Staff",
        "companyName": "Brgy Hall Sta. Monica",
        "date": "2020 – 2022",
        "descriptions": [
          "Designed and developed a resident management system using Microsoft Access and VBA to streamline data handling and request tracking",
          "Automated report generation and data entry, significantly reducing manual workload",
          "Produced and maintained key reports for community initiatives and administrative processes",
          "Handled the full process for resident ID requests, from data collection to coordination with ID producers",
          "Assisted with resident concerns and provided tech support for data-driven conflict resolution",
          "Maintained structured databases while enforcing best practices in data management and integrity"
        ]
      }
    }
  },
  "contactForm": {
    "fields": {
      "name": {
        "label": "Name",
        "placeholder": "Juan Dela Cruz"
      },
      "email": {
        "label": "Email",
        "placeholder": "juandelacruz@example.com"
      },
      "message": {
        "label": "Your Message",
        "placeholder": "e.g. Hello! Let's connect."
      }
    },
    "submit": {
      "button": "Send Message",
      "loading": "Sending Message..."
    },
    "validation": {
      "name": {
        "minLength": "Name must be at least 2 characters long",
        "maxLength": "Name must be less than 50 characters"
      },
      "email": {
        "invalid": "Please enter a valid email address"
      },
      "message": {
        "minLength": "Message must be at least 10 characters long",
        "maxLength": "Message must be less than 500 characters"
      }
    },
    "errors": {
      "spamDetected": "Spam detected.",
      "unexpectedError": "An unexpected error occurred. Please try again."
    },
    "messages": {
      "fixErrors": "Please fix the errors in the form",
      "success": "Message sent successfully!",
      "submissionError": "An error occurred while sending your message. Please try again."
    }
  },
  "notFound": {
    "subtitle": "Page not found",
    "description": "We can’t find the page you’re looking for",
    "goHome": "Go back home"
  },
  "chat": {
    "tools": {
      "contact": {
        "description": "Get in touch with Simon — whether through socials or by sending a quick message below."
      },
      "projects": {
        "description": "Explore Simon’s projects — each one comes with a detailed explanation, including the thought process, problem-solving approach, and in-depth description of the work. Browse through his portfolio to see not just what he built, but also how he built it."
      }
    }
  }
}
