{
  "containers": {
    "navBar": {
      "controls": {
        "toggle": "Toggle navigation menu"
      },
      "mobileMenu": {
        "title": "Navigation Menu",
        "description": "Browse through the main sections of the site.",
        "close": "Close mobile menu",
        "avatar": "Mobile Nav Avatar"
      },
      "links": {
        "home": "Home",
        "about": "About",
        "experience": "Experience",
        "projects": "Projects",
        "connect": "Connect"
      }
    }
  },
  "common": {
    "mainNavigation": "Main navigation",
    "navigateToHome": "Navigate to Home",
    "navigateToSection": "Navigate to {section} section",
    "languageDropdown": {
      "label": "Choose Language"
    },
    "themeToggle": {
      "darkMode": "Toggle Dark Mode",
      "lightMode": "Toggle Light Mode"
    },
    "socialLinks": {
      "reddit": "Visit my Reddit profile",
      "frontendmentor": "Visit my Frontend Mentor profile",
      "github": "Visit my GitHub",
      "linkedin": "Visit my LinkedIn profile",
      "email": "Send me an email"
    }
  },
  "heroSection": {
    "location": "Pampanga, Philippines",
    "name": "Simon Camacho",
    "title": "Software Engineer",
    "description": "I am a developer who enjoys learning and expanding knowledge in the field of web. I am also determined to create solutions that provide excellent online experiences. Explore my portfolio to see my growing skills and dedication to quality development.",
    "contact": "Contact",
    "resume": "Resume",
    "backgroundCarlos": "Carlos",
    "backgroundSimon": "Simon",
    "heroImageAlt": "Hero Image"
  },
  "aboutSection": {
    "title": "About Me",
    "journeyHeader": "My Journey",
    "journey": "Hi! I’m Simon. A self-taught programmer who realized code could build worlds—or at least, really fun retro games.<br></br><br></br>My first encounter with coding was in 2018, when I stumbled on a YouTube video of someone building Tetris in C++. I was 16 and obsessed: Wait, you can just… make games? So I dove in, armed with C++ tutorials and dreams of recreating every pixelated classic I’d ever played (Snake, Frogger—you name it).<br></br><br></br>Fast-forward to today: I’m a Software Engineer at a startup, wrangling Next.js, NestJS, and Stripe to build apps that actually earn money (a wild concept to 16-year-old-me). My proudest moment? Learning payment integrations and seeing strangers use—and pay for—something I helped create.<br></br><br></br>But I’m itching for my next challenge. I love full-stack work—whether it’s crafting sleek UIs with shadcn or debugging backend mysteries. And while I didn’t take the traditional CS path, my time building systems and web apps proved something: code isn’t just about games; it’s about solving real problems.<br></br><br></br>When I'm not coding, I'm probably at the gym, sleeping, or dead.<br></br><br></br>I focus on clean fundamentals, building systems that are sustainable, easy to maintain, and built to last.",
    "skillsHeader": "My Skills"
  }
}
